# Эти словари содержат перечни предметов соответствующего типа.
# Каждый элемент содержит кортеж, в котором значения означают следующее:
# 0 - название, 1 - атака, 2 - ловкость, 3 - сила, 4 - меткость, 5 - крит, 6 - мастерство

EQUIPMENT_COLLECTION = "wow_classic_preraid"

RIGHT_HANDS = dict()
RIGHT_HANDS[1] = ('Священный заряд Дал\'Ренда', 81, 0, 4, 0, 1, 0)
RIGHT_HANDS[2] = ('Искатель сердец', 49, 0, 4, 0, 1, 0)
RIGHT_HANDS[3] = ('Песня Мираха', 57, 9, 9, 0, 0, 0)

LEFT_HANDS = dict()
LEFT_HANDS[1] = ('Племенной страж Дал\'Ренда', 52, 0, 0, 0, 0, 0)
LEFT_HANDS[2] = ('Искатель сердец', 49, 0, 4, 0, 1, 0)
LEFT_HANDS[3] = ('Песня Мираха', 57, 9, 9, 0, 0, 0)

GLOVES = dict()
GLOVES[1] = ('Рукавицы девизавра', 28, 0, 0, 0, 1, 0)
GLOVES[2] = ('Костяные когти Скула', 40, 0, 0, 0, 0, 0)

HEADS = dict()
HEADS[1] = ('Маска непрощённых', 0, 0, 0, 2, 1, 0)
HEADS[2] = ('Глаз Ренда', 0, 0, 13, 0, 2, 0)
HEADS[3] = ('Личина Ликана', 32, 0, 8, 0, 0, 0)
HEADS[4] = ('Призрачный покров', 0, 19, 12, 0, 0, 0)

CHESTS = dict()
CHESTS[1] = ('Трупная броня', 60, 8, 8, 0, 0, 0)
CHESTS[2] = ('Мундир Объятий ночи', 50, 5, 0, 0, 0, 0)
CHESTS[3] = ('Мундир бармена', 0, 11, 18, 0, 0, 0)

PANTS = dict()
PANTS[1] = ('Поножи девизавра', 46, 0, 0, 0, 1, 0)
PANTS[2] = ('Поножи Мастера клинка', 0, 5, 0, 1, 1, 0)

BOOTS = dict()
BOOTS[1] = ('Сапоги скорохода', 0, 21, 4, 0, 0, 0)
BOOTS[2] = ('Лапы Жуткого волка', 40, 0, 0, 0, 0, 0)
BOOTS[3] = ('Мангустовые сапоги', 0, 23, 0, 0, 0, 0)
