# Эти словари содержат перечни предметов соответствующего типа.
# Каждый элемент содержит кортеж, в котором значения означают следующее:
# 0 - название, 1 - атака, 2 - ловкость, 3 - сила, 4 - меткость, 5 - крит, 6 - мастерство

EQUIPMENT_COLLECTION = 'custom'

RIGHT_HANDS = dict()
RIGHT_HANDS[1] = ('Праворучный Страж Лесов', 50, 3, 0, 0, 0, 0)
RIGHT_HANDS[2] = ('Меч Ловкача', 40, 22, 0, 0, 0, 0)
RIGHT_HANDS[3] = ('Меч Точности', 40, 0, 0, 3, 0, 0)
RIGHT_HANDS[4] = ('Меч Мастера', 40, 0, 0, 0, 0, 5)

LEFT_HANDS = dict()
LEFT_HANDS[1] = ('Леворучный Страж Лесов', 35, 3, 0, 0, 0, 0)
LEFT_HANDS[2] = ('Меч Ловкача', 40, 22, 0, 0, 0, 0)
LEFT_HANDS[3] = ('Меч Точности', 40, 0, 0, 3, 0, 0)
LEFT_HANDS[4] = ('Меч Мастера', 40, 0, 0, 0, 0, 5)

GLOVES = dict()
GLOVES[1] = ('Перчатки Прыткости', 0, 12, 0, 2, 0, 0)
GLOVES[2] = ('Перчатки Всестороннести', 2, 2, 2, 1, 1, 0)

HEADS = dict()
HEADS[1] = ('Капюшон Ловкача', 0, 22, 0, 0, 0, 0)
HEADS[2] = ('Капюшон Жестокости', 0, 0, 0, 0, 2, 0)
HEADS[3] = ('Капюшон Концентрации', 0, 0, 0, 2, 0, 0)

CHESTS = dict()
CHESTS[1] = ('Мундир Ловкача', 0, 30, 0, 0, 0, 0)
CHESTS[2] = ('Мундир Жестокости', 0, 0, 0, 0, 3, 0)
CHESTS[3] = ('Мундир Концентрации', 0, 0, 0, 3, 0, 0)

PANTS = dict()
PANTS[1] = ('Поножи Ловкача', 0, 24, 0, 0, 0, 0)
PANTS[2] = ('Поножи Жестокости', 0, 0, 0, 0, 2, 0)
PANTS[3] = ('Поножи Концентрации', 0, 0, 0, 2, 0, 0)

BOOTS = dict()
BOOTS[1] = ('Сапоги Кровавой мести', 14, 0, 5, 0, 1, 0)
BOOTS[2] = ('Сапоги Тишины', 0, 18, 0, 1, 0, 0)
